# INdexing

In [61]:
import pandas as pd
import numpy as np

In [126]:

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data)
data_frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# Index can be adjust by self

In [127]:
#method 1
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data,index=["Names",123,"@","/","ABC","!"])  #set indexes
data_frame2

        state  year  pop
Names    Ohio  2000  1.5
123      Ohio  2001  1.7
@        Ohio  2002  3.6
/      Nevada  2001  2.4
ABC    Nevada  2002  2.9
!      Nevada  2003  3.2

In [128]:
# (#method 2  Without set the name of index)

In [129]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data,["Names",123,"@","/","ABC","!"])  #set indexes
data_frame2

        state  year  pop
Names    Ohio  2000  1.5
123      Ohio  2001  1.7
@        Ohio  2002  3.6
/      Nevada  2001  2.4
ABC    Nevada  2002  2.9
!      Nevada  2003  3.2

# Accessing the indexing

In [130]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data,["Names",123,"@","/","ABC","!"])  #set indexes
data_frame2

        state  year  pop
Names    Ohio  2000  1.5
123      Ohio  2001  1.7
@        Ohio  2002  3.6
/      Nevada  2001  2.4
ABC    Nevada  2002  2.9
!      Nevada  2003  3.2

# How to Access the rows
-  loc (its works on the string indexs of columns)
-  iloc (Its works on the integers indexs of the rows)

In [131]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [132]:
frame2.loc["one"]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [133]:
frame2.loc["six"]

year       2003
state    Nevada
pop         3.2
debt        NaN
Name: six, dtype: object

In [134]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data)  #set indexes
data_frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [135]:
data_frame2.iloc[0]

state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

# HEAD AND TAIL

In [136]:
data_frame2.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [137]:
data_frame2.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

# How to Access the indexes
- columns
- name of columns
- name of column in index

In [138]:
data_frame2.columns

Index(['state', 'year', 'pop'], dtype='object')

In [139]:
data_frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [140]:
data_frame2.pop

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [141]:
data_frame2["pop"]

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [142]:
data_frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

# How to add columns

In [143]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data_frame2=pd.DataFrame(data,columns=['year', 'state', 'pop', 'Degree',"Numpy range","Extra"])
data_frame2

   year   state  pop Degree Numpy range Extra
0  2000    Ohio  1.5    NaN         NaN   NaN
1  2001    Ohio  1.7    NaN         NaN   NaN
2  2002    Ohio  3.6    NaN         NaN   NaN
3  2001  Nevada  2.4    NaN         NaN   NaN
4  2002  Nevada  2.9    NaN         NaN   NaN
5  2003  Nevada  3.2    NaN         NaN   NaN

# Assigning values is debt

In [144]:
data_frame2.Degree="Bscs"
data_frame2

   year   state  pop Degree Numpy range Extra
0  2000    Ohio  1.5   Bscs         NaN   NaN
1  2001    Ohio  1.7   Bscs         NaN   NaN
2  2002    Ohio  3.6   Bscs         NaN   NaN
3  2001  Nevada  2.4   Bscs         NaN   NaN
4  2002  Nevada  2.9   Bscs         NaN   NaN
5  2003  Nevada  3.2   Bscs         NaN   NaN

# assigning numpy list in dataframe columns

In [145]:
data_frame2["Numpy range"]=np.arange(6,)*3
data_frame2

   year   state  pop Degree  Numpy range Extra
0  2000    Ohio  1.5   Bscs            0   NaN
1  2001    Ohio  1.7   Bscs            3   NaN
2  2002    Ohio  3.6   Bscs            6   NaN
3  2001  Nevada  2.4   Bscs            9   NaN
4  2002  Nevada  2.9   Bscs           12   NaN
5  2003  Nevada  3.2   Bscs           15   NaN

# Assigning series with columns

In [146]:
s1=pd.Series([1.3,45,67,67],index=[2,3,5,4])
data_frame2["Extra"]=s1
data_frame2

   year   state  pop Degree  Numpy range  Extra
0  2000    Ohio  1.5   Bscs            0    NaN
1  2001    Ohio  1.7   Bscs            3    NaN
2  2002    Ohio  3.6   Bscs            6    1.3
3  2001  Nevada  2.4   Bscs            9   45.0
4  2002  Nevada  2.9   Bscs           12   67.0
5  2003  Nevada  3.2   Bscs           15   67.0

# Del columns

In [147]:
del data_frame2["state"]

In [148]:
data_frame2

   year  pop Degree  Numpy range  Extra
0  2000  1.5   Bscs            0    NaN
1  2001  1.7   Bscs            3    NaN
2  2002  3.6   Bscs            6    1.3
3  2001  2.4   Bscs            9   45.0
4  2002  2.9   Bscs           12   67.0
5  2003  3.2   Bscs           15   67.0

# transpose columns

In [149]:
data_frame2.T

                0     1     2     3     4     5
year         2000  2001  2002  2001  2002  2003
pop           1.5   1.7   3.6   2.4   2.9   3.2
Degree       Bscs  Bscs  Bscs  Bscs  Bscs  Bscs
Numpy range     0     3     6     9    12    15
Extra         NaN   NaN   1.3    45    67    67